Revit 2027 API
ElectricalSystem.OtherConductorSize Property
 The size of an Other Conductor in the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OtherConductorSize { get; }
Public ReadOnly Property OtherConductorSize As ElementId
	Get
public:
property ElementId^ OtherConductorSize {
	ElementId^ get ();
}
member OtherConductorSize : ElementId with get
Property Value
ElementId
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 Each Other Conductor has the same size in the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace